<a href="https://colab.research.google.com/github/GauravSahani1417/Python-Practice-Codes/blob/master/Pandas_Tricks_Youtube.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

df = pd.DataFrame(dict(col_1=[1.53,-2.5,3.53], 
                       col_2=[-4.1,5.9,0])
                 )

In [ ]:
def color_negative_red(val):
    color = 'red' if val < 0 else 'green'
    return 'color: %s' % color

df.style.applymap(color_negative_red)

#### Memory usage(in bytes)

In [ ]:
df.memory_usage(deep=False)

Index    128
col_1     24
col_2     24
dtype: int64

The reader may have experienced the following issues when using .head(n) to check the dataframe:

*   Thereâ€™re too many columns / rows in the dataframe and some columns / rows in the middle are omitted.
*  Columns containing long texts get truncated.

In [ ]:
import pandas as pd 
pd.options.display.max_columns = 50  # None -> No Restrictions
pd.options.display.max_rows = 200    # None -> Be careful with this 
pd.options.display.max_colwidth = 100
pd.options.display.precision = 3

In [ ]:
df.head()

   col_1  col_2
0   1.53   -4.1
1  -2.50    5.9
2   3.53    0.0

#Crosstabs:

In [ ]:
import pandas as pd

In [ ]:
df1 = pd.DataFrame(dict(Departure=['MUM','MUM','DEL','DEL','MUM','MUM','DEL','MUM'],
                        Arrival=['G1','G1','G3','G2','G2','G4','G3','G1'],
                        Airline=['Indigo','Indigo','Vistara','Indigo','AirAsia','Indigo','Vistara','AirIndia']))

In [ ]:
df1.head()

  Departure Arrival  Airline
0       MUM      G1   Indigo
1       MUM      G1   Indigo
2       DEL      G3  Vistara
3       DEL      G2   Indigo
4       MUM      G2  AirAsia

In [ ]:
pd.crosstab(index=[df1['Departure'],df1['Airline']],
            columns=[df1['Arrival']],
            rownames=['Departure','Airline'],
            colnames=['Arrival'],
            margins=True)

Arrival             G1  G2  G3  G4  All
Departure Airline
DEL       Indigo     0   1   0   0    1
          Vistara    0   0   2   0    2
MUM       AirAsia    0   1   0   0    1
          AirIndia   1   0   0   0    1
          Indigo     2   0   0   1    3
All                  3   2   2   1    8

### Query:

In [ ]:
df1.head()

  Departure Arrival  Airline
0       MUM      G1   Indigo
1       MUM      G1   Indigo
2       DEL      G3  Vistara
3       DEL      G2   Indigo
4       MUM      G2  AirAsia

In [ ]:
df1.query('Airline == "Indigo"')

  Departure Arrival Airline
0       MUM      G1  Indigo
1       MUM      G1  Indigo
3       DEL      G2  Indigo
5       MUM      G4  Indigo

In [ ]:
df1.query('Airline == "Indigo" or Airline == "Vistara"')

  Departure Arrival  Airline
0       MUM      G1   Indigo
1       MUM      G1   Indigo
2       DEL      G3  Vistara
3       DEL      G2   Indigo
5       MUM      G4   Indigo
6       DEL      G3  Vistara

#### Scrap html pages with python! (before you go with BS4, Scrapy, etc!)

In [ ]:
amazon_stocks = pd.read_html('https://finance.yahoo.com/quote/AMZN?p=AMZN')

In [ ]:
pd.concat([amazon_stocks[0],amazon_stocks[1]])

                          0                            1
0            Previous Close                      3110.87
1                      Open                      3127.00
2                       Bid                   0.00 x 800
3                       Ask                  0.00 x 1400
4               Day's Range          3,120.85 - 3,177.00
5             52 Week Range          1,885.78 - 3,552.25
6                    Volume                      3540586
7               Avg. Volume                      3695123
0                Market Cap                        1.58T
1         Beta (5Y Monthly)                         1.13
2            PE Ratio (TTM)                        75.01
3                 EPS (TTM)                        41.83
4             Earnings Date  Apr 28, 2021 - May 03, 2021
5  Forward Dividend & Yield                    N/A (N/A)
6          Ex-Dividend Date                          NaN
7             1y Target Est                      3999.36